# зареждане на библиотеката за графичен плот
import matplotlib.pyplot as plt

# създаване на празни списъци за нарисуваните обекти и координати на точките на линията
drawn_objs, coords = [], []

def ruler_plt(fig, ax):
    """
    Функция за измерване на дължини върху плот с линия. Точките на линията се поставят върху изображението с RMB.

    аргументи:
        fig: плотираната фигура, върху която ще се чертае
        ax: подплота (изображението), върху което ще се чертае

    Връща координатите на линията като списък [(x1, y1), (x2, y2)].
    """
    # задаване на празните списъци за нарисуваните обекти и координати на точките на линията като глобални и инициализация
    global drawn_objs, coords
    drawn_objs, coords = [], []

    # дефиниция на функцията при кликване върху снимката
    def line_onclick(event):
        # проверка, че е натиснат RMB
        if event.button == 3:
            # запаметяване на координатите на клика в променливите ix и iy в пиксели
            ix, iy = event.xdata, event.ydata
            # проверка, че ix и iy са валидни
            if ix is not None and iy is not None:
                # задаване на следните променливи като глобални
                global coords, drawn_objs

                # проверка дали вече са запаметени координатите на две или повече точки
                if len(coords) >= 2:
                    # изтриване на всички запаметени точки и маркировки по снимката, за да започне чертането отначало
                    del coords[:]
                    for obj in drawn_objs: obj.remove()
                    del drawn_objs[:]

                # маркиране на позицията на клика върху снимката
                drawn_objs.append(ax.scatter([ix], [iy], color='r', marker='x'))
                # изписване на координатите на клика върху снимката
                drawn_objs.append(ax.text(ix, iy, 'x=' + str(round(ix)) + ', y=' + str(round(iy))))
                # запаметяване на координатите на кликването като точка
                coords.append((ix, iy))

                # проверка дали началната и крайната точка на линията са поставени
                if len(coords) == 2:
                    # изобразяване на линията върху снимката
                    drawn_objs.append(ax.add_line(plt.Line2D((coords[0][0], ix),
                                                            (coords[0][1], iy), color='r')))
        # връщане на координатите на точките
        return coords
    
    # активиране на функцията за чертане на линия при кликване върху плота
    cid = fig.canvas.mpl_connect('button_press_event', line_onclick)

    # връщане на координатите на точките
    return coords